https://chrisalbon.com/python/data_wrangling/pandas_map_values_to_values/

In [5]:
import pandas as pd
import numpy as np

In [2]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [3]:
city_to_state = { 'San Francisco' : 'California', 
                  'Baltimore' : 'Maryland', 
                  'Miami' : 'Florida', 
                  'Douglas' : 'Arizona', 
                  'Boston' : 'Massachusetts'}

In [4]:
df['state'] = df['city'].map(city_to_state)
df

  first_name last_name  age           city          state
0      Jason    Miller   42  San Francisco     California
1      Molly  Jacobson   52      Baltimore       Maryland
2       Tina       Ali   36          Miami        Florida
3       Jake    Milner   24        Douglas        Arizona
4        Amy     Cooze   73         Boston  Massachusetts

https://chrisalbon.com/python/data_wrangling/pandas_apply_operations_to_dataframes/

In [6]:
data2 = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df2 = pd.DataFrame(data2, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df2

             name  year  reports  coverage
Cochice     Jason  2012        4        25
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70

In [7]:
capitalizer = lambda x: x.upper()

In [8]:
df2['name'].apply(capitalizer)

Cochice       JASON
Pima          MOLLY
Santa Cruz     TINA
Maricopa       JAKE
Yuma            AMY
Name: name, dtype: object

In [11]:
df2['name'].map(capitalizer)

Cochice       JASON
Pima          MOLLY
Santa Cruz     TINA
Maricopa       JAKE
Yuma            AMY
Name: name, dtype: object

In [12]:
df2['capital'] = df2['name'].apply(capitalizer)
df2

             name  year  reports  coverage capital
Cochice     Jason  2012        4        25   JASON
Pima        Molly  2012       24        94   MOLLY
Santa Cruz   Tina  2013       31        57    TINA
Maricopa     Jake  2014        2        62    JAKE
Yuma          Amy  2014        3        70     AMY

In [13]:
from genderize import Genderize
genderize = Genderize(
    user_agent='GenderizeDocs/0.0',
    api_key='08402238f4c2af82034ed0a16e4d36cb')

In [14]:
gender_magic = lambda x: genderize.get(x,country_id='US')

In [15]:
df2['gender'] = df2['name'].apply(gender_magic)

In [18]:
df2['gender']

Cochice       [{'name': 'J', 'gender': 'male', 'probability'...
Pima          [{'name': 'M', 'gender': 'male', 'probability'...
Santa Cruz    [{'name': 'T', 'gender': 'male', 'probability'...
Maricopa      [{'name': 'J', 'gender': 'male', 'probability'...
Yuma          [{'name': 'A', 'gender': 'male', 'probability'...
Name: gender, dtype: object

In [17]:
df2.gender[0]

[{'name': 'J', 'gender': 'male', 'probability': 0.68, 'count': 60},
 {'name': 'a', 'gender': 'male', 'probability': 0.61, 'count': 18},
 {'name': 's', 'gender': 'male', 'probability': 0.61, 'count': 18},
 {'name': 'o', 'gender': 'male', 'probability': 0.88, 'count': 8},
 {'name': 'n', 'gender': 'female', 'probability': 0.75, 'count': 4}]

In [19]:
df2['gender_try2'] = genderize.get(df2['name'],country_id='US')

In [21]:
df2['gender_try2']

Cochice       {'name': 'Jason', 'gender': 'male', 'probabili...
Pima          {'name': 'Molly', 'gender': 'female', 'probabi...
Santa Cruz    {'name': 'Tina', 'gender': 'female', 'probabil...
Maricopa      {'name': 'Jake', 'gender': 'male', 'probabilit...
Yuma          {'name': 'Amy', 'gender': 'female', 'probabili...
Name: gender_try2, dtype: object

In [27]:
print(df2['gender_try2'][0]['gender'])

male

In [ ]:
tester = lambda x: x.upper()

In [ ]:
#https://chrisalbon.com/python/data_wrangling/pandas_create_column_with_loop/

In [29]:
gender_final = []

for item in df2['gender_try2']:
    gender_id = item['gender']
    gender_final.append(gender_id)
    
df2["gender_final"] = gender_final

In [30]:
df2

,name,year,reports,coverage,capital,gender,gender_try2,gender_final
Cochice,Jason,2012,4,25,JASON,"[{'name': 'J', 'gender': 'male', 'probability'...","{'name': 'Jason', 'gender': 'male', 'probabili...",male
Pima,Molly,2012,24,94,MOLLY,"[{'name': 'M', 'gender': 'male', 'probability'...","{'name': 'Molly', 'gender': 'female', 'probabi...",female
Santa Cruz,Tina,2013,31,57,TINA,"[{'name': 'T', 'gender': 'male', 'probability'...","{'name': 'Tina', 'gender': 'female', 'probabil...",female
Maricopa,Jake,2014,2,62,JAKE,"[{'name': 'J', 'gender': 'male', 'probability'...","{'name': 'Jake', 'gender': 'male', 'probabilit...",male
Yuma,Amy,2014,3,70,AMY,"[{'name': 'A', 'gender': 'male', 'probability'...","{'name': 'Amy', 'gender': 'female', 'probabili...",female